Ruby_on_Rails/myrecipe/app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.chef = Chef.find(1) #test case only

    if @recipe.save
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "recipes" ("name", "summary", "description", "chef_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 3]]

  def update
    @recipe = Recipe.find(params[:id])

    if @recipe.update(recipe_params)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "recipes" SET "picture" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["picture", "colourful_sky___facebook_timeline_banner_by_nanonl-d51vvz0.png"], ["updated_at", "2015-12-04 07:02:04.213983"], ["id", 1]]